In [1]:
import psycopg2
from sqlalchemy import create_engine
import pandas as pd

In [2]:
#Define connection. enter password, and remember to remove the password before commit back to github
#engine=create_engine('postgresql://username:password@host:port/databasename)
engine=create_engine('postgresql://')

#review table names
table_names=engine.table_names()
print(table_names)

['team_member', 'candidate_summary_join', 'census_bus_employee', 'census_social_0617', 'committee_linkage_join', 'master_join', 'master_join1', 'fec_summary', 'fec_operating_expenditure', 'cq_race', 'cq_candidates_race', 'individual_contribution_join_abbreviated', 'fec_committee', 'fec_candidate', 'test_join', 'investigate', 'cross_walk', 'fec_candidate_committee_linkage', 'fec_individual_contribution', 'cq_race_incumbent', 'fec_committee_to_candidate_contribution', 'fec_committee_to_committee_contribution', 'fec_committee_2012', 'fec_table_join', 'test_join_win', 'candidate_join', 'fec_join', 'individual_contribution_join']

In [3]:
df=pd.read_sql_query('SELECT * from individual_contribution_join_abbreviated', engine)

In [4]:
#Review
type(df)

pandas.core.frame.DataFrame

In [5]:
df.head()

,cand_id,result,cand_pty_affliation,cmte_id,amndt_ind,rpt_tp,transaction_pgi,entity_tp,name,state,transaction_dt,transaction_amt,sub_id
0,H4PA13124,1,DEM,C00389197,A,Q2,P,IND,"WOLF, WENDY C. ...",PA,04132011,250.0,4120120141231841188
1,H4PA13124,1,DEM,C00389197,A,Q2,P,IND,"WORTH, ROBERT R ...",NY,06302011,250.0,4120120141231841189
2,H4PA13124,1,DEM,C00389197,A,Q2,P,IND,"WORTH, ROBERT R ...",NY,06302011,250.0,4120120141231841189
3,H4PA13124,1,DEM,C00389197,A,Q2,P,IND,"WUKICH, ALEXIS ...",PA,06242011,250.0,4120120141231841190
4,H4PA13124,1,DEM,C00389197,A,Q2,P,IND,"WUKICH, ALEXIS ...",PA,06242011,250.0,4120120141231841190

In [6]:
df.tail()

,cand_id,result,cand_pty_affliation,cmte_id,amndt_ind,rpt_tp,transaction_pgi,entity_tp,name,state,transaction_dt,transaction_amt,sub_id
2078606,H4PA13124,1,DEM,C00389197,A,Q2,P,IND,"WINKELMAN, MARC ...",TX,06302011,250.0,4120120141231841186
2078607,H4PA13124,1,DEM,C00389197,A,Q2,P,IND,"WINKELMAN, MARC ...",TX,06302011,250.0,4120120141231841186
2078608,H4PA13124,1,DEM,C00389197,A,Q2,P,IND,"WOLF, STEPHANIE ...",PA,06242011,2500.0,4120120141231841187
2078609,H4PA13124,1,DEM,C00389197,A,Q2,P,IND,"WOLF, STEPHANIE ...",PA,06242011,2500.0,4120120141231841187
2078610,H4PA13124,1,DEM,C00389197,A,Q2,P,IND,"WOLF, WENDY C. ...",PA,04132011,250.0,4120120141231841188

In [11]:
df.to_csv("fec.csv", sep=',')